01  WS-AREA-1 PIC 9(5) VALUE 0. 
01  WS-AREA-2 PIC 9(5) VALUE 0.
01 WS-OVERFLOW-FLAG PIC 9 VALUE 0.

PROCEDURE DIVISION.
    ADD 1 TO WS-AREA-1.
    IF WS-AREA-1 > 50000
        MOVE 50000 TO WS-AREA-2
        MOVE 1 TO WS-OVERFLOW-FLAG
    ELSE
        MOVE WS-AREA-1 TO WS-AREA-2
    END-IF.
    DISPLAY "WS-AREA-2: " WS-AREA-2
    IF WS-OVERFLOW-FLAG = 1 THEN
        DISPLAY "OVERFLOW OCCURRED"
    END-IF
    STOP RUN.